export interface GreatPerson {
  id: number;
  name: string;
  content: string;
}

export const greatPeople: GreatPerson[] = [
  {
    id: 0,
    name: "أبي بكر الصديق",
    content: "رجلٌ في التاريخ يؤمن برسالة محمد -صلى اللَّه عليه وسلم-، وهو أول أعظم عشرة رجال وطأت أقدامهم الأرض بعد الأنبياء. كان من خيرة رجال مكة قبل الإسلام، وكان أبو سيدة عائشة رضي اللَّه عنها. وقف حائلًا منيعًا أمام انحدار العنصر البشري إلى ظلمات الجهل والتخلف بعد انقطاع الوحي السماوي. الفضل الأول لأبي بكر الصديق عليّ وعليك وعلى سائر المسلمين بل وعلى سائر البشر هو وقوفه حائلًا منيعًا أمام انحدار العنصر البشري إلى ظلمات الجهل والتخلف بعد انقطاع الوحي السماوي. فلقد بعث اللَّه الأنبياء بدعوة التوحيد عبر جميع العصور، فآمن بهم من آمن وكفر بهم من كفر، ولكن أغلب أولئك المؤمنين وذريتهم انحرفوا عن جادة الصواب بعد موت أنبيائهم."
  },
  {
    id: 1,
    name: "الأمير محمد بن عبد الكريم الخطابي",
    content: "أسطورة المغرب الإسلامي، البطل الإسلامي الأسطوري الذي قاد معركة أنوال الخالدة ضد الإسبان. كان مولى مغربي أمازيغي لموسى بن نصير، وقاد المقاومة الإسلامية في المغرب. اختراقه لسجنه بحبل من قماش فراشه يعتبر من أسطورة البطولة. أسطورة المغرب الإسلامي الذي قاد معركة أنوال الخالدة ضد الإسبان."
  },
  {
    id: 2,
    name: "السيدة هاجر",
    content: "نصيب نساء الإسلام يفوق النصف بين عظماء هذه الأمة. تنتمي إلى الأمة العظيمة، ولفظة القبط تعني سكان وادي النيل. وقفت بين صفا ومروة لإنقاذ ابنها الرضيع، وعظمتها الإيمان والعمل."
  },
  {
    id: 3,
    name: "عمرو بن العاص",
    content: "أرطبون العرب، قائد عسكري مبدع في فتوحات الإسلام. شارك في فتوحات الأندلس وكان من بين القادة العسكريين البارزين. كان صبيًا يافعًا في الصف التاسع في إحدى مدارس مدينة رفح الفلسطينية."
  },
  {
    id: 4,
    name: "النجاشي (أصحمة بن أبجر)",
    content: "الجندي المجهول في أمة الإسلام الذي ساهم في الفتوحات الإسلامية."
  },
  {
    id: 5,
    name: "المقداد بن عمرو",
    content: "صديق رسول الله ومن الأعظم درساء الأمة."
  },
  {
    id: 6,
    name: "البدريون",
    content: "أبطال الفتوحات الإسلامية."
  },
  {
    id: 7,
    name: "الزبير بن العوّام",
    content: "حواري رسول الله وأحد الصحابة البارين."
  },
  {
    id: 8,
    name: "طلحة بن عبيد اللَّه",
    content: "حواري رسول الله وقائد مبدع في الفتوحات."
  },
  {
    id: 9,
    name: "سليم الأول",
    content: "مدمر دولة الصفويين في المشرق الإسلامي."
  }
];

export default greatPeople;